import math

# #算术运算符：+，-，*，/，//，%，**
# # 算数运算符的优先级 --> ** -->* / // %  --> + -
# print("10+4=",10+4)
# print("10-4=",10-4)
# print("10*4=",10*4)
# print("10/4=",10/4)
# print("10//4=",10//4)#整除
# print("10%4=",10%4)
# print("10**4=",10**4)#幂指数，10的4次方
#
# #案例：要求输入两个数x与y，分别输出x+y的结果和x-y的结果
# x = float(input("请输入x的值："))
# y = float(input("请输入y的值："))
#
# #0.09999999999999998 -->0.5-0.4精度损失 ; 由于计算机底层是基于二进制无法准确表示所有小数，因此涉及浮点数运算可能会损失精度
# print("x+y=", x + y)
# print("x-y=", x - y)

#案例1：计算输入的三个整数的平均数
# x = int(input("请输入x的值："))
# y = int(input("请输入y的值："))
# z = int(input("请输入z的值："))
# print(f"平均数：{(x+y+z)/3}")
#案例2：要求输入梯形的上底、下底、高，然后计算梯形的面积
# x = float(input("请输入梯形上底的值："))
# y = float(input("请输入梯形下底的值："))
# z = float(input("请输入梯形高的值："))
# print(f"梯形面积：{(x+y)*z/2}")
#案例3：要求输入圆的半径，然后计算圆的周长和面积
# r = float(input("请输入圆的半径："))
# print(f"圆的周长：{2*math.pi*r}")
# print(f"圆的面积：{math.pi*r**2}")
# #案例4：身体素质指数BMI的计算（BMI= 体重（kg）/身高（m）的平方）
# #1、输入体重
# x = float(input("请输入体重(kg)："))
# #2、输入身高
# y = float(input("请输入身高(m)："))
# #3、计算身体质量指数BMI并输出
# print(f"您的BMI为：{x/y**2}")

#赋值运算符：
num = 85

num += 10
print(num)

num -= 10
print(num)

num *= 10
print(num)

num /= 10
print(num)

num //= 10
print(num)

num %= 3
print(num)

num **= 3
print(num)

########比较运算符：== != > >= < <=
print("100 == 100吗：", 100 == 100)  #True
print("'100'=='100'吗：", '100' == '100')  #True
print("100!=100吗：", 100 != 100)

print("100<100吗：", 100 < 100)
print("100<=100吗：", 100 <= 100)

print("100>100吗：", 100 > 100)
print("100>=100吗：", 100 >= 100)

# 需求1:键盘输入一个整数，判断这个数字是否在10-20之间 --> 在：True,不在：false
n = int(input("请输入一个整数："))
print(f"{n}在10-20之间：", n >= 10 and n <= 20)
#或print(f"{n}在10-20之间：", 10 <= n <= 20)

# 需求1:键盘输入一个整数，判断这个数字是否不在10-20之间
n = int(input("请输入一个整数："))
print(f"{n}不在10-20之间：", n < 10 or n > 20)
